{
  "name": "AgAnt Token",
  "symbol": "AgAnt",
  "decimals": 11,
  "description": "AgAnt Coin: A Meme Coin and Economic Integration Experiment1. IntroductionAgAnt Coin has emerged as a meme coin and an economic integration experiment. This whitepaper explains the technical details, economic model, and goals of AgAnt Coin.2. Project DescriptionAgAnt Coin is a project created similar to popular meme coins like Shiba or Pepe Coin. Our main objective is to provide a fun experience while involving users in the crypto ecosystem. The total supply of AgAnt Coin is 7,495,100,000, which corresponds to the average global silver reserves.3. Goals and Liquidity LockThe primary goal of AgAnt Coin is to reach a price equivalent to 1 gram of silver. This objective aims to increase the value of the coin over time and provide users with a long-term investment opportunity. Additionally, a liquidity lock strategy has been implemented. Initially, liquidity will be locked to prevent sudden price fluctuations, and then it will remain locked for 99 years.4. Team and DistributionAgAnt Coin was created by an anonymous team. Team members have not received any coins to contribute to the project independently of their personal interests. This aims to ensure the project is managed fairly and impartially.5. Trading Tax and Whale Prevention MechanismsAgAnt Coin does not impose any tax on buying or selling transactions. This allows users to buy and sell the coin more easily and economically. Additionally, whale prevention mechanisms are implemented, limiting any wallet's ownership to a maximum of 1%. These mechanisms aim to prevent large token holders from manipulating the market.6. Marketing Strategy and Investor BenefitsAgAnt Coin aims to benefit investors by starting with a low market cap. The distribution of cheap coins during presales has not been favored, allowing investors to benefit more from the coin's value appreciation. Effective marketing strategies will be utilized for the success of our project.7. Collaborations and Economic IntegrationAgAnt Coin aims to promote economic integration and facilitate users' access to the crypto ecosystem through collaborations. In the later stages of our project, we plan to develop partnerships and integrations with other projects to reach a wider user base. This will contribute to the acceptance and use of AgAnt Coin, fostering economic integration.8. Security and Legal MattersAgAnt Coin places great importance on security. The project's technical infrastructure and smart contracts are designed in accordance with the highest security standards. Moreover, we are taking necessary steps for legal and regulatory compliance. Throughout the execution of our project, we will take the required measures to fully comply with relevant legal regulations and provide users with a secure environment to participate in AgAnt Coin.9. Community Support and Future PlansAgAnt Coin aims to grow with strong community support. The community plays a critical role in the success of our project. Therefore, community management, transparency, and communication are our priorities. We plan to further develop the project by considering the feedback and suggestions from community members. Our future plans include strengthening marketing activities, conducting social media campaigns, and adding new features and applications that will provide more value to our users.10. ConclusionAgAnt Coin is designed as a meme coin and economic integration experiment. Our goal is to involve users in the crypto ecosystem and provide a fun experience while increasing the value of the coin for investors to benefit. AgAnt Coin adheres to principles such as fair distribution, security, and community support. We thank you for your interest and support in our project and invite you to join our community for the successful development of AgAnt Coin.",
  "discord": "",
  "telegram": "https://t.me/AgAnttoken",
  "twitter": "https://twitter.com/AgAnttoken",
  "website": "https://agant.world/",
  "vested": [],
  "audits": [],
  "explorer": "https://bscscan.com/token/0x0c920ac31aF492674fdccb36D7aAA3e373f7c0C3",
  "id": "0x0c920ac31aF492674fdccb36D7aAA3e373f7c0C3"
}