{
  "name": "DAPPSY",
  "symbol": "APP",
  "decimals": 8,
  "description": "What is Dappsy?Dappsy is the Social Network of Cryptocurrencies. A platform where you can reach other cryptocurrency investors, track crypto assets and your current coin/token investments.There is so much you can do on Dappsy...and the beauty of it? - *It's Anonymous.* To use Dappsy you don't an email or a phone number to sign up, only a *Metamask wallet.*We have a target audience of ~400 million people who have a broad interest in cryptocurrencies and regularly use social networks to discuss ideas and acquire information from cryptocurrency communities. These individuals use social medias to interact with one another, share and receive opinions, and gain an overview of their assets, which leads them to the future of the cryptocurrency market.What makes Dappsy unique?Dappsy is more than just a crypto social network; we are creating a welcoming environment for new and experienced investors. We talk about blockchain and cryptocurrencies. We talk about ATH and ATL. Graphs are our morning coffee, and the latest crypto news is our breakfast. Our users are free to use other social media networks for anything else. We want to be a crypto social network where people from all over the world get together to debate cryptocurrency on a daily basis. You have everything in one spot as a Dappsy user.APP, the native utility token:The APP Token is the currency that entitles you to a share of Dappsy's revenue. Our native token is a currency as well as an asset. APP does not have to be reliant on investor trading, but rather be treated as a valuable asset. APP Formula: Ad Net Revenue (Expenses + Treasury) / Ad Net Revenue = Revenue Share % The ad revenue we generate on the platform affects the APP's main value. This revenue share is derived from advertisements placed on the platform by our advertisers. This means that by treating APP token as a currency and asset, all of our token holders will benefit from Dappsy revenue. All other revenues generated by Dappsy, such as transactions, premium subscriptions, or any other form of revenue we propose in the future, will be included in this revenue share. Ad Net Revenue - Ads, promotions, and other monetization methods generating revenue for the platform. Expenses - Employees, operating costs, and any other expense that is necessary to keep Dappsy running are examples of company expenses. Rewarding moderators with bounties is also an expense that helps us keep the environment free of spammers, scammers, and other entities. Treasury - Dappsy, as a platform, requires a treasury in order to adapt to new technologies, improve, or survive. Revenue Share - This amount will be used to buy back tokens from Liquidity Pool and put it towards expanding our influence. This has a direct impact on the value of APP tokens on both decentralized and centralized exchanges.How Many APP Coins Are There in Circulation?At launch there were 148,000,000 tokens minted, and after the consecutive burns, the circulating supply is 117,957,997.",
  "discord": "",
  "telegram": "https://t.me/dappsy_official",
  "twitter": "https://twitter.com/itsdappsy",
  "website": "https://dappsy.io",
  "vested": [],
  "audits": [
    "https://github.com/dappsy/audit/blob/main/DAPPSY-APP-Audit.pdf"
  ],
  "explorer": "https://bscscan.com/token/0x81e07CfF8a9331eF2A837B15a3560fb186bF5E8D",
  "id": "0x81e07CfF8a9331eF2A837B15a3560fb186bF5E8D"
}