{
  "name": "Blockchain Explorer",
  "symbol": "BCE",
  "decimals": 10,
  "description": "Blockchain Explorer (BCE) is a DeFi-Based Ecosystem built for users and investors alike.  “BCEswap” is our Crypto Exchange; and “BCE Wallet” is our Digital Wallet. We aim to give users a fast and secure way to explore Decentralized Applications (Dapp) and find any digital/virtual asset regardless of the blockchain on which they are built; and we give Investors a secure way to buy and store crypto and other digital assets…all without leaving our platform. We intend to bridge the gap between Blockchains to meet your crypto needs.       Do you ever wish there was a universal platform that supports all your favorite cryptocurrencies? If you are a crypto enthusiast like us, you probably had to sign up on tons of crypto exchanges, and have multiple type of digital wallets installed on your devices, just to be able to have all the coins you believe will take you to “The Moon.” Why? Because Crypto A is available on Exchange A but not on Exchange B that you have already been using. So, you have to sign up on Exchange A to buy Crypto A that you are so eager to purchase. Same goes for digital wallets; wallet A support coin A but not Coin B. So, you had to install a different wallet that support Coin B to store your coins. Just like that you end up having your assets on so many exchanges and wallets that it becomes hard to keep proper track of them. We create Blockchain Explorer so Crypto Enthusiasts can have a universal platform to securely trade, store, and manage all crypto assets.       Our Digital Wallet (BCE Wallet) will come with a Crypto Saving Account feature that will allow Investors who participate in the program to earn interest on their crypto assets. This is a feature never offered before by any existing digital wallet. It works just like traditional saving account except better. Participating in the Crypto Saving Account program will earn investors 10-time the return giving by traditional saving account. Additionally, our wallet will offer the features below and more:  Securely store digital currencies protected by military-grade encryption and other security features; buy crypto with USD for little to no fee in addition to swapping crypto; make secure payment to any merchant that accepts crypto as a payment method; receive refund in digital currency; remain anonymous when making online transactions; transfer money to friends and family securely and easily.       As for the Crypto Exchange (BCEswap), we intend to reward crypto investors for each transaction made on BCEswap. The more you trade the lower your transaction fee. We will also implement a Frequent-Trader program which will allow Crypto traders to earn reward just for using our exchange service. Investors will have three options to claim their reward/points: 1. Amazon Gift Card. 2. Transfer the rewards/points to the Electronic Visa card that will be implemented in our system. 3. Use it to buy our Coin (BCE), other cryptocurrencies, or to purchases Non-Fungible Token in the NFT Marketplace. Other features of the Crypto Exchange will include P2P Lending & Borrowing; staking services to allow investors to earn partial income; buying crypto token at a low fee (less than half the fee charged by other existing exchanges); farming that allows investors to lend their token and earn interest, and more.       Metaverse: Effort to bridge to the Samsung Blockchain is ongoing; and Samsung Blockchain recently added full support for Decentraland (The Metaverse Platform). For us, that means once our services are fully integrated with the Blockchain, users of our services will have the option to sell/purchase virtual assets in the Metaverse via Decentraland. That includes land, avatar clothing, in-game items, videos, and everything else available in the Metaverse. “BCE” Coin will be the native token used to pay for all transaction fees. BCE Coin holders will also be able to use the coin to purchase applications in the Play Store or to make In-App purchases. ",
  "discord": "",
  "telegram": "https://t.me/OneBlockchain_Pro",
  "twitter": "https://twitter.com/1Blockchain_Pro ",
  "website": "https://coindappexplorer.com/",
  "vested": [],
  "audits": [],
  "explorer": "https://bscscan.com/token/0x88E89EB5C0Aa7bf8079a902ac2c72662c5c6F941",
  "id": "0x88E89EB5C0Aa7bf8079a902ac2c72662c5c6F941"
}