{
  "name": "Tom coin",
  "symbol": "TMC",
  "decimals": 18,
  "description": "Tom Coin is a crypto project that issued $TMC meme cryptocurrency on the Binance Smart Chain. So, the management appeals to all people. The startup wants to attract poor, rich, young, and old community members. Apart from the above, the developers aim to launch the play-to-earn game and Tom’s metaverse. Simultaneously the team goal is to build a school on every continent. TMC is a BEP20 (BSC) token that allows holders to participate in Tom’s charity initiatives. Also, this altcoin will enable access to the project’s P2E game in the future. Besides, $TMC is a meme coin that can attract all memes lovers worldwide. As Tom coin we are charging 2% tax for buying and selling, that will , which of 1%to marketing and 1% for lp support . If you love memes, This is the best driven meme coin the team aims to build schools in poor courtiers and support cats shelters. Also, the developers released a P2E game based on Tom character with metaverse where you can buy cats with different rarities of of the marketplace or randomly out of the cat shop. Therefore, the developers of Tomcoin have decided to fully secure the initial capital and liquidity of the project by sending it in its entirety to the forever looked LP address. It is impossible to reverse this process. This is the highest form of security that can be offered since the contract is renounced. Transparency is ensured by the fact that no personal contribution was retained before the token was made available. The former Creator Wallet contains about 2.9% of the total supply, The purchased shares will be used to fund All Tom coin futures projects over an extended period of time. This process will be done piece by piece and always in discussion with the community. A large sale at any point in time is not intended to provide stability.",
  "discord": "",
  "telegram": "https://t.me/Tomcoin_bsc",
  "twitter": "https://twitter.com/Tomcoin_bsc?t=f-BkcqiYlp5rfy8r0lzWQA&s=09",
  "website": "Https://Tomcoin.net",
  "vested": [],
  "audits": [
    "http://www.tomcoin.net/wp-content/uploads/2022/04/TomCoin_0xb27e4DE03A6823Ddcf4e53606D5AeEC295377D70.pdf"
  ],
  "explorer": "https://bscscan.com/token/0x8f1fE4e6707CD4236b704759d2ee15166C68183a",
  "id": "0x8f1fE4e6707CD4236b704759d2ee15166C68183a"
}