{
  "name": "BlanchGroupToken",
  "symbol": "BGT",
  "decimals": 18,
  "description": "The Blanch Group is a leading multi-faceted Investment Tribal Association Trust with investments in essentials, in prominent and respected markets, in multiple industry segments. The Blanch Group is a dynamic and diversified Institution with an extensive interest to impact the Globe. The Blanch Group is a gateway for individuals and companies wanting to enter a global market, we venture into businesses across the world in all types of industries and at any stage within their business cycle. Set in a leading consumer market and a popular tourist destination for a Global Resource Economy, we have geared our current efforts towards expansion, with a strong focus on multiple sectors. Our focus is on maximizing each business opportunity which is presented to us, and creating mutually beneficial partnerships with like-minded companies and entrepreneurs, around the world. We work with our partners to create long-term business relationships, utilizing our expertise, professionalism and a diverse business-to-business network. We are positioning ourselves for global expansion, we actively assess outbound as well as inbound investment propositions, placing Techonology, Marketing, and Capital in businesses and other vehicles that are designed to generate tangible social impact as well as a financial return. Our ultimate Goal are to globally expand and build Smart cities into a Global Resource Economy. The Blanch Group vision is implemented across different markets and sectors on the basis of scientific methods and careful analysis of the local, regional, and global market dynamics. We have an in-depth understanding of the most promising investment and technology opportunities in a variety of sectors forming a diversified Tribal Association Trust. In addition, The Blanch Group believes in the principle of constant business development, diversification, and geographic global expansion. As such, The Blanch Group business activities have expanded from the local market to cover extensive regional and global markets. At The Blanch Group, we are focused on a dynamic and decisive approach to investment. We operate a straight forward and effective business model and our strong and dynamic team of local and international business professionals is highly skilled in identifying commercial potential and translating it into live, profitable business entities. We welcome all opportunities and embrace innovation. Therefore we never limit ourselves to shareholding in any specific sector. We evaluate every opportunity on its merit and potential to grow. Our specialty is innovative businesses; however we invest and market in companies in all stages of their business cycle. Our long term mission is build Eco Friendly Smart cities for a Global Resource Economy. The success of The Blanch Group's strategy is well proven by Investment in Companies which categories are divided in the HEED Program - Health, Education, Enterprising, and Development. Promoting, showcase, and Companies in A Business-to-Business Network. Last but not Least reinvest into economic ventures to stabilize the world with a Global Resource Economy.",
  "discord": "https://discord.gg/Ax63ZN3AVt",
  "telegram": "https://t.me/Hrhwillblanch",
  "twitter": "",
  "website": "http://www.blanchgroup.com",
  "vested": [],
  "audits": [],
  "explorer": "https://bscscan.com/token/0x20e4C6Fbf9A8142f89Dd0F9a33cadf5918aB1D47",
  "id": "0x20e4C6Fbf9A8142f89Dd0F9a33cadf5918aB1D47"
}